package com.leodiam.java2Solutions.ex9;

import java.awt.*;

//Άσκηση 9: Μία απλή γραφική εφαρμογή
//
//        Task 1
//        Να γραφεί μία κλάση με όνομα Tahsildar και προσδιοριστή public
//η οποία να περιέχει μια δημόσια ορατή στατική μέθοδο με όνομα
//        saloon. Η μέθοδος saloon δέχεται ως όρισμα μία μεταβλητή τύπου
//        Graphics και δεν επιστρέφει κανένα  αποτέλεσμα. Στην μέθοδο saloon,
//        χρησιμοποιώντας το αντικείμενο Graphics, να ζωγραφίσετε ένα τετράγωνο
//        με κέντρο τις συντεταγμένες (82, 75) και πλευρά μήκους 48, χρησιμοποιώντας
//        το χρώμα κίτρινο (yellow). Στην συνέχεια ζωγραφίστε ένα ευθύγραμμο
//        τμήμα με αρχή τις συντεταγμένες (173, 169) και τέλος τις συντεταγμένες
//        (155, 99), χρώματος άσπρο (white). Τέλος χρωματίστε ένα σημείο
//        με συντεταγμένες (135, 21) δίνοντας του χρώμα πράσινο (green).
public class Tahsildar {


    public static void saloon(Graphics g) {
        g.setColor(Color.YELLOW);
        g.drawRect(58, 51, 48, 48);


        g.setColor(Color.white);
        g.drawLine(173, 169, 155, 99);

        g.setColor(Color.GREEN);
        g.drawLine(135, 21, 135, 21);


    }
}
