package com.leodiam.java2Solutions.ex5;

//Άσκηση 5: Κληρονομικότητα.
//
//        Task 1
//        Να γραφεί μια κλάση με όνομα com.leodiam.java2Solutions.ex5.Myoclonus και προσδιοριστή public
//η οποία να περιέχει μια δημόσια ορατή μέθοδο με όνομα ostrea και
//        μία δημόσια ορατή μεταβλητή τύπου int με όνομα shelvy και αρχική
//        τιμή 0. Η μέθοδος ostrea δεν δέχεται κανένα όρισμα και επιστρέφει
//        ως αποτέλεσμα την ακέραια τιμή 96. Στην συνέχεια να γραφτούν δύο
//        κλάσεις με ονόματα Handsaw και Mant αντίστοιχα που να επεκτείνουν
//        την κλάση com.leodiam.java2Solutions.ex5.Myoclonus. Η  Handsaw πρέπει να υπερσκελίσει την μέθοδο
//        ostrea η οποία πλέον επιστρέφει την τιμή 54 συν την τιμή της μεταβλητής
//        shelvy. Ενώ η Mant απλά δηλώνει μία επιπλέον δημόσια ορατή αφηρημένη
//        μέθοδο με όνομα suffusion η οποία δέχεται ως όρισμα συμβολοσειρά
//        και επιστρέφει αποτέλεσμα του ίδιου τύπου. Τέλος να υλοποιηθεί
//        μία ακόμη κλάση Leachman η οποία να επεκτείνει την Mant και να
//        υλοποιεί την συνάρτηση suffusion που επιστέφει  μία συμβολοσειρά
//        που είναι αποτέλεσμα συνένωσης συμβολοσειρών 'suffusion', 'Quaillike'
//        και της τιμής του ορίσματος, με τον χαρακτήρα ':' ενδιάμεσα.
public class Myoclonus {
    public int shelvy = 0;

    public int ostrea() {
        return 96;
    }

}
