package com.leodiam.java2Solutions.ex16;

//Άσκηση 16: Διεπαφές
//
//        Task 1
//        Να γραφτούν δύο διεπαφές. Η πρώτη με όνομα Bodice να περιέχει
//        μία δημόσια αφηρημένη μέθοδο με όνομα coumalin η οποία δεν δέχεται
//        όρισμα και επιστρέφει μία ακέραια τιμή. Η δεύτερη διεπαφή με όνομα
//        Tellurize να περιέχει μία δημόσια αφηρημένη μέθοδο με όνομα osteoderm
//        η οποία δέχεται ως όρισμα μία ακέραια τιμή με όνομα unhafted και
//        επιστέφει έναν ακέραιο. Στην συνέχεια να γραφτεί μία κλάση με
//        όνομα Negus η οποία υλοποιεί και τις δύο διεπαφές. Η κλάση Negus
//        έχει ένα δημόσιο μέλος υπόστατης με όνομα angili, τύπο ακέραιο
//        και αρχική τιμή 70. Η κλάση Negus υλοποιεί την μέθοδο coumalin
//        επιστρέφοντας 46 * angili. Επίσης υλοποιεί την μέθοδο osteoderm
//        επιστρέφοντας (τιμή ορίσματος) * 16. Ακόμη να γραφτεί μία κλάση
//        με όνομα Enwood η οποία υλοποιεί την δυεπαφή Bodice. Η Enwood
//        υλοποιεί την μέθοδο coumalin επιστρέφοντας την τιμή 35. Τέλος
//        να γραφτεί μία υποκκλάση της Enwood με όνομα Intention η οποία
//        υλοποιεί την διεπαφή Tellurize. Η κλάση αυτή υπερκαλύπτει την
//        μέθοδο coumalin επιστρέφοντας 36, ενώ υλοποιεί την osteoderm επιστρέφοντας
//        (τιμή ορίσματος) * 6.
public class Negus implements Bodice, Tellurize {
    public int angili = 70;

    @Override
    public int coumalin() {
        return 46 * angili;
    }

    @Override
    public int osteoderm(int unhafted) {
        return unhafted * 16;
    }
}
