package com.leodiam.java2Solutions.exam;
//Task 2
//        Nα γραφεί μια κλάση με όνομα Pulverate η οποία περιέχει ένα ιδιωτικό
//        στατικό πεδίο με όνομα kohl. Ο τύπος του πεδίου είναι συμβολοσείρα
//        και περιέχει μια μεταγλλωτισμένη κανονική έκφραση που ταιρίαζει
//        μια συμβολοσειρά βάσει του ακόλουθου προτύπου:
//
//        * Αρχίζει με αλφαριθμητική ακολουθία χαρακτήρων που αποτελείται
//        από τουλάχιστον έναν χαρακτήρα.
//        * Ακολουθείται από τον χαρακτήρα '/'
//        * Ακολουθείται από τουλάχιστον ένα αριθμητικό ψηφίο.
//        * Ακολουθείται από τον χαρακτήρα '.'
//        * Τελειώνει με μια ακολουθία αριθμητικών ψηφίων η οποία απότελείται
//        από τουλάχιστον ένα ψηφίο.
//
//        Να γραφεί μια δημόσια στατική μέθοδος tassah που παίρνει ένα όνομα
//        αρχείου (τύπου String) και επιστρέφει μια λίστα από αντικείμενα
//        τύπου Salivate.Η μέθοδος διαβάζει το αρχείο γραμμή-γραμμή και
//        'φιλτράρει' (κρατάει) όσες γραμμές ταιριάζουν με το πρότυπο της
//        κανονικής έκφρασης του πεδίου kohl. Αν μια γραμμή του αρχείου
//        ταιριάζει με το πρότυπο, η μέθοδος χωρίζει την γραμμή στα δύο
//        βάσει του χαρακτήρα '/'. Το πρώτο μέρος της γραμμής εκχωρείται
//        σε μια μεταβλητή τύπου συμβολοσειράς και όνομα shakeable, ενώ
//        το δεύτερο μετατρέπεται σε double και εκχωρείται σε μεταβλητή
//        με όνομα speechful. Αν η τιμή της μεταβλητής shakeable ξεκινάει
//        με κεφαλαίο γράμμα τότε η μέθοδος δημιουργεί ένα αντικείμενο της
//        κλάσης Plang περνώντας ως ορίσματα το shakeable και το speechful.Σε
//        διαφορετική περίπτωση, η tassah κατασκευάζει ένα αντικείμενο της
//        κλάσης Posturer με τα ίδια ορίσματα. Μετά την δημιουργία των αντικειμένων
//        η μέθοδος τα  βάζει σε μια λίστα την οποία και επιστρέφει.
//
//        Να γραφεί μια δημόσια στατική μέθοδος με όνομα enemylike η οποία
//        πέρνει ως όρισμα μια λίστα από Salivate και επιστρέφει ένα αντικείμενο
//        τύπου Salivate. Η μέθοδος θα πρέπει να επιστρέφει το στοιχείο
//        της λίστας x για το οποίο το αποτέλεσμα της κλήσης x.honduran()
//        είναι το μεγαλύτερο.
//
//        Σημείωση: θεωρείστε ότι το αρχείο βρίσκεται στον ίδιο κατάλογο
//        από τον οποίο τρέχετε την διεργασία του jarpeb.

public class Pulverate {
    private static String kohl;
}
